## Topic 5

In this exercise, we will explore SQL programming using Jupyter Notebooks. We will need the following libraries in the environment: `ipython-sql`, `sqlalchemy`, `prettytable`.

### Quick overview

1. Load the `sql` module with the `ipython` cell magic.

In [ ]:
%load_ext sql

The following sets the output table styles to one of the legacy `prettytable` display formats.

In [31]:
%config SqlMagic.style = '_DEPRECATED_MARKDOWN'

2. Connect to a database.

    + Our practice database `basic_examples.db` is stored as a locall file. 
    
    + In real world practid, we will need to connect to a remote server.

In [ ]:
%sql sqlite:///data/basic_examples.db

3. Run a SQL statement

    The following shows all tables in this example database.

In [30]:
%%sql
SELECT * 
FROM sqlite_master 
WHERE type= 'table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 7, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'Dragon', 'Dragon', 2, 'CREATE TABLE Dragon (\n    name TEXT PRIMARY KEY,\n    year INTEGER CHECK (year >= 2000),\n    cute INTEGER\n)'),
 ('table', 'Dish', 'Dish', 4, 'CREATE TABLE Dish (\n    name TEXT PRIMARY KEY,\n    type TEXT,\n    cost INTEGER CHECK (cost >= 0)\n)'),
 ('table', 'Scene', 'Scene', 6, "CREATE TABLE Scene (\n    id INTEGER PRIMARY KEY AUTOINCREMENT,\n    biome TEXT NOT NULL,\n    city TEXT NOT NULL,\n    visitors INTEGER CHECK (visitors >= 0),\n    created_at DATETIME DEFAULT (DATETIME('now'))\n)")]

In [34]:
%%sql
SELECT * 
FROM Dragon;

Done.

[('hiccup', 2010, 10),
 ('drogon', 2011, -100),
 ('dragon 2', 2019, 0),
 ('puff', 2010, 100),
 ('smaug', 2011, None)]

### Alternative approach

We can also use `sqlalchemy` - pass in a SQL query as a string to return a `pandas` DataFrame.

In [ ]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('sqlite:///data/basic_examples.db')
connection = engine.connect()

In [33]:
query = '''
SELECT * 
FROM Dragon;
'''
pd.read_sql(query, engine)

       name  year   cute
0    hiccup  2010   10.0
1    drogon  2011 -100.0
2  dragon 2  2019    0.0
3      puff  2010  100.0
4     smaug  2011    NaN

## Case study

In [8]:
import pandas as pd
import sqlalchemy
engine = sqlalchemy.create_engine('sqlite:///data/mammals.sqlite')
connection = engine.connect()

In [13]:
query = '''
SELECT *
FROM sqlite_master
WHERE type = 'table'
'''
pd.read_sql(query, connection)

,type,name,tbl_name,rootpage,sql
0,table,surveys,surveys,2,"CREATE TABLE surveys (\n\trecord_id BIGINT, \n..."
1,table,species,species,241,"CREATE TABLE species (\n\tspecies_id TEXT, \n\..."
2,table,plots,plots,242,"CREATE TABLE plots (\n\tplot_id BIGINT, \n\tpl..."